<?php
/**
 * Created by PhpStorm.
 * User: Popov
 * Date: 28.9.2019 г.
 * Time: 17:27
 */

namespace StanimiraNikolova\Services\PageData;


use StanimiraNikolova\Repositories\PageData\PageDataRepository;
use StanimiraNikolova\Repositories\PageData\PageDataRepositoryInterface;
use StanimiraNikolova\Services\AbstractService;

class PageDataService extends AbstractService implements PageDataServiceInterface
{
    /** @var  PageDataRepository */
    private $pageDataRepository;

    public function __construct(PageDataRepositoryInterface $pageDataRepository)
    {
        $this->pageDataRepository = $pageDataRepository;
    }

    public function GetPageData(string $code, string $subCode) : array
    {
        $pageData = $this->pageDataRepository->getPageData([':code' => $code, ':sub_code' => $subCode]);

        $pageData1 = [
            'home' => [
                'pageTitle' => 'Начало',
                'text' => 'Авторът - Станимира Николова е доктор по научна специалност Политическа икономия. С тема на дисертация Обща факторна производителност и регионални различия в икономическия растеж на България за периода 1999 – 2012 г. Тя успешно е преподавала в Русенски университет Ангел Кънчев по дисциплини, свързани с икономическия растеж, както и дисциплини, свързани с  Международния бизнес и Маркетинг. В момента работи в областта на застраховането, като е представител на застрахователен брокер Балкан. Ако имате нужда от Маркетингова стратегия и Маркетингово проучване за вашия проект или от повишаване на квалификацията и преподавател в областта на Икономическия растеж  и Международния бизнес или от всички видове застраховки, може да се свържете със Станимира Николова на тел. 0877 822 350 или в офиса на улица Църковна независимост 5, ет. 2, офис 2.Авторът с удоволствие би приел всички препоръки и забележки.'
            ],
            'internationalBusiness' => [
                'pageTitle' => 'Международен бизнес',
                'text' => 'Учебното помагало по Международен бизнес е предназначен основно за студенти от специалности МИО, Маркетинг и Икономика, но може да бъде ползван и от други специалности. Той може да бъде полезен за висши училища, изучаващи подобна тематика. Учебното помагало има  практическа насоченост и разглежда традиционните външнотърговски сделки, както и комплексните външноикономически операции, които се характеризират с по-висока степен на сложност и риск. Всяка тема завършва с ключови думи, задачи и въпроси за самоподготовка. Учебното помагало може да намерите тук.'
            ],
            'contacts' => [
                'pageTitle' => 'Контакти',
                'text' => 'Д-р Станимира Николова<br>
                           Адрес: Гр. Русе, ул. Църковна независимост 5, вх. 1, ет.2, офис 2<br>
                           Тел. 0877 822 350<br>
                           e-mail: snikolova@zbkbalkan.com'
            ],
            'insurance' => [
                'whyToInsurance' => [
                    'pageTitle' => 'Защо да се застраховаме',
                    'text' => 'Ще Ви дам конкретен пример – преди три месеца брат ми си счупи крака и първата работа на лекарите беше да попитат дали има застраховка, тъй като здравната каса поема само труда на лекарите, а всички останали консумативи са за сметка на пациента. Тъй като брат ми нямаше застраховка се наложи сам да плати цялата операция от 5000 лева и да похарчи всичките си спестявания. Затова е нужно да се застраховаме, защото нищо не се знае какво може да ни донесе съдбата. Ако имате нужда от застраховка Злополука, застраховка Живот или нужда от застраховка за вашия дом или кола не се колебайте и звъннете на нас. Ние предлагаме безплатна консултация за всички видове застраховки тел.0877 822 350'
                ],
                'whatWeSell' => [
                    'pageTitle' => 'Какво предлагаме на клиентите',
                    'text' => 'Изгодна цена Предлагаме най-доброто съотношение – ниска цена при най-добро застрахователно покритие, като можем да избираме измежду всички водещи застрахователни компании в бранша. Съдействие при настъпила щета Ако сте наш клиент и настъпи застрахователно събитие, обадете ни се! Ще получите пълно съдействие пред застрахователя от наша страна. Избор на застрахователна компания Ще Ви помогнем да изберете подходяща застрахователна компания за конкретния вид застраховка. Работим с всички водещи застрахователни компании в бранша! Удобна локация Офисът ни се намира в сърцето на град Русе, до съда. Ул. Църковна независимост 5, ет. 2, офис 2. Изграденото доверие и дългосрочни отношения с нашите клиенти са най-добрият показател за оценка на работата ни!'
                ]
            ]
        ];

        return $pageData;
    }
}