-- --------------------------------------------------------
-- Хост:                         127.0.0.1
-- Версия на сървъра:            10.1.16-MariaDB - mariadb.org binary distribution
-- ОС на сървъра:                Win32
-- HeidiSQL Версия:              9.4.0.5125
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;


-- Dumping database structure for stanimira_nikolova_db
DROP DATABASE IF EXISTS `stanimira_nikolova_db`;
CREATE DATABASE IF NOT EXISTS `stanimira_nikolova_db` /*!40100 DEFAULT CHARACTER SET utf8 */;
USE `stanimira_nikolova_db`;

-- Дъмп структура за таблица stanimira_nikolova_db.menu
DROP TABLE IF EXISTS `menu`;
CREATE TABLE IF NOT EXISTS `menu` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `code` varchar(255) NOT NULL,
  `title` varchar(255) NOT NULL,
  `sub_code_id` int(11) NOT NULL DEFAULT '0',
  `sort_order` int(11) NOT NULL DEFAULT '0',
  `with_sub_menu` tinyint(4) NOT NULL DEFAULT '0',
  `active` tinyint(4) NOT NULL DEFAULT '0',
  `user_id` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `code` (`code`),
  KEY `FK_menu_users` (`user_id`),
  CONSTRAINT `FK_menu_users` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=12 DEFAULT CHARSET=utf8;

-- Дъмп данни за таблица stanimira_nikolova_db.menu: ~11 rows (approximately)
DELETE FROM `menu`;
/*!40000 ALTER TABLE `menu` DISABLE KEYS */;
INSERT INTO `menu` (`id`, `code`, `title`, `sub_code_id`, `sort_order`, `with_sub_menu`, `active`, `user_id`) VALUES
	(1, 'home', 'Начало', 0, 1, 0, 1, 1),
	(2, 'internationalBusiness', 'Международен бизнес', 0, 2, 0, 1, 1),
	(3, 'insurance', 'Застраховане', 0, 5, 1, 1, 1),
	(4, 'whyToInsurance', 'Защо да се застраховаме', 3, 1, 0, 1, 1),
	(5, 'whatWeSell', 'Какво предлагаме на клиентите', 3, 2, 0, 1, 1),
	(6, 'contacts', 'Контакти', 0, 6, 0, 1, 1),
	(7, 'marketingStrategies', 'Маркетингови стратегии ', 0, 3, 0, 1, 1),
	(8, 'economicGrowth', 'Икономически растеж', 0, 4, 0, 1, 1),
	(9, 'whyToChooseUs', 'Защо да изберете нас', 3, 3, 0, 1, 1),
	(10, 'whichCompaniesWeWork', 'С кои компании работим', 3, 4, 0, 1, 1),
	(11, 'whoWeAre', 'Кои сме ние', 3, 5, 0, 1, 1);
/*!40000 ALTER TABLE `menu` ENABLE KEYS */;

-- Дъмп структура за таблица stanimira_nikolova_db.page_data
DROP TABLE IF EXISTS `page_data`;
CREATE TABLE IF NOT EXISTS `page_data` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `code` varchar(255) NOT NULL,
  `sub_code` varchar(255) NOT NULL,
  `page_title` varchar(255) DEFAULT NULL,
  `text` text,
  `user_id` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `code_sub_code` (`code`,`sub_code`),
  KEY `FK_page_data_users` (`user_id`),
  CONSTRAINT `FK_page_data_users` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=11 DEFAULT CHARSET=utf8;

-- Дъмп данни за таблица stanimira_nikolova_db.page_data: ~10 rows (approximately)
DELETE FROM `page_data`;
/*!40000 ALTER TABLE `page_data` DISABLE KEYS */;
INSERT INTO `page_data` (`id`, `code`, `sub_code`, `page_title`, `text`, `user_id`) VALUES
	(1, 'home', '', 'Начало', 'Авторът - Станимира Николова е доктор по научна специалност Политическа икономия. С тема на дисертация Обща факторна производителност и регионални различия в икономическия растеж на България за периода 1999 – 2012 г. Тя успешно е преподавала в Русенски университет Ангел Кънчев по дисциплини, свързани с икономическия растеж, както и дисциплини, свързани с  Международния бизнес и Маркетинг. В момента работи в областта на застраховането, като е представител на застрахователен брокер Балкан. Ако имате нужда от Маркетингова стратегия и Маркетингово проучване за вашия проект или от повишаване на квалификацията и преподавател в областта на Икономическия растеж  и Международния бизнес или от всички видове застраховки, може да се свържете със Станимира Николова на тел. 0877 822 350 или в офиса на улица Църковна независимост 5, ет. 2, офис 2.Авторът с удоволствие би приел всички препоръки и забележки.', 1),
	(2, 'internationalBusiness', '', 'Международен бизнес', 'Учебното помагало по Международен бизнес е предназначен основно за студенти от специалности МИО, Маркетинг и Икономика, но може да бъде ползван и от други специалности. Той може да бъде полезен за висши училища, изучаващи подобна тематика. Учебното помагало има  практическа насоченост и разглежда традиционните външнотърговски сделки, както и комплексните външноикономически операции, които се характеризират с по-висока степен на сложност и риск. Всяка тема завършва с ключови думи, задачи и въпроси за самоподготовка. Учебното помагало може да намерите <a href="http://localhost/stanimira_nikolova/content/internationalBusiness.docx">тук</a>.', 1),
	(3, 'contacts', '', 'Контакти', 'Д-р Станимира Николова<br>Адрес: Гр. Русе, ул. Църковна независимост 5, вх. 1, ет.2, офис 2<br>Тел. 0877 822 350<br>e-mail: snikolova@zbkbalkan.com', 1),
	(4, 'insurance', 'whyToInsurance', 'Защо да се застраховаме', 'Ще Ви дам конкретен пример – преди три месеца брат ми си счупи крака и първата работа на лекарите беше да попитат дали има застраховка, тъй като здравната каса поема само труда на лекарите, а всички останали консумативи са за сметка на пациента. Тъй като брат ми нямаше застраховка се наложи сам да плати цялата операция от 5000 лева и да похарчи всичките си спестявания. Затова е нужно да се застраховаме, защото нищо не се знае какво може да ни донесе съдбата. Ако имате нужда от застраховка Злополука, застраховка Живот или нужда от застраховка за вашия дом или кола не се колебайте и звъннете на нас. Ние предлагаме безплатна консултация за всички видове застраховки тел.0877 822 350', 1),
	(5, 'insurance', 'whatWeSell', 'Какво предлагаме на клиентите', 'Изгодна цена Предлагаме най-доброто съотношение – ниска цена при най-добро застрахователно покритие, като можем да избираме измежду всички водещи застрахователни компании в бранша. Съдействие при настъпила щета Ако сте наш клиент и настъпи застрахователно събитие, обадете ни се! Ще получите пълно съдействие пред застрахователя от наша страна. Избор на застрахователна компания Ще Ви помогнем да изберете подходяща застрахователна компания за конкретния вид застраховка. Работим с всички водещи застрахователни компании в бранша! Удобна локация Офисът ни се намира в сърцето на град Русе, до съда. Ул. Църковна независимост 5, ет. 2, офис 2. Изграденото доверие и дългосрочни отношения с нашите клиенти са най-добрият показател за оценка на работата ни!', 1),
	(6, 'marketingStrategies', '', 'Маркетингови стратегии и маркетингови проучвания', 'Направена е примерна маркетингова стратегия и маркетингово проучване на фирма Телекабел АД. Маркетинговата стратегия може да намерите <a href="http://localhost/stanimira_nikolova/content/marketingStrategies.docx">тук</a>. Маркетинговото проучване може да намерите <a href="http://localhost/stanimira_nikolova/content/marketingResearch.docx">тук</a>.', 1),
	(7, 'economicGrowth', '', 'Икономически растеж и регионално развитие', 'Статията - Фактори, определящи регионалните различия в икономическия растеж на България за периода 1999 – 2012 година. разглежда регионални различия в икономическия растеж на България, както и необходимостта от органичен подход при изучаването на икономическата система. Статията може да намерите <a href="http://localhost/stanimira_nikolova/content/economicGrowth.docx">тук</a>.', 1),
	(8, 'insurance', 'whyToChooseUs', 'Защо да изберете нас', 'Предлагаме всички застраховки за фирми и граждани. Съобразяваме нашите предложения/ поне три на брой/ с нуждите на клиента, а не се опитваме да впишем клиента в определени предложения. Информирани сме за всичко, което се случва на застрахователния пазар. Така успяваме да сме максимално полезни на нашите клиенти. Подходът ни е изцяло ориентиран към клиента. Внимателно разглеждаме всеки отделен случай и предлагаме най-добрите варианти за конкретния клиент. Имаме солиден опит и задълбочени познания в застраховането. Спестяваме на клиентите време, усилия и средства, като елиминираме риска да направят не напълно информиран избор. Оказваме пълно съдействие по вече направените застраховки. Ние сме на разположение при възникнали въпроси, при завеждане на щети или в случай на спорове със застрахователя. Обадете се за безплатна консултация на тел. 0877 822 350! Пишете ни или заповядайте на място в нашия офис, който се намира в административния център на град Русе. Ул. Църковна независимост 5, вх.1, ет.2, офис ', 1),
	(9, 'insurance', 'whichCompaniesWeWork', 'С кои компании работим', 'Работим с всички водещи компании в бранша, като Булстрад, Алианц, Бул Инс, ДЗИ, Групама, ОЗК, Лев Инс, Армеец,  и други. ', 1),
	(10, 'insurance', 'whoWeAre', 'Кои сме ние', 'Застрахователен Брокер "БАЛКАН" АД е създаден през 1998 г. Към настоящия момент застрахователният брокер извършва мониторинг върху управлението на риска и застрахователните потребности на повече от 15 000 фирми в цялата страна. Нашите основни приоритети са, свързани с осигуряване на измерими резултати за нашите клиенти: защита на активи, оптимизиране на разходи, добавяне на стойност, практическо решаване на щети. Застрахователното посредничество на нашата комапния е с фокус върху интересите на клиента. За всеки от клиентие си, от корпорации до търговски обекти , изготвяме застрахователна програма с възможност за пълна оценка на управлението на риска, оптимизиране на баланса между цена и защита. Международно застраховане Застрахователен Брокер Балкан обслужва корпоративните застрахователни програми на дъщерни дружества на международни компании с глобално световно присъствие. Нашите Клиенти са в България, Македония, Албания и Румъния. Чрез партньорите ни на водещите международни застрахователни пазари осигуряваме застрахователно покритие от водещите международни застрахователни групи. По този начин на практика осигуряваме застрахователно обслужване в 110 страни на света.', 1);
/*!40000 ALTER TABLE `page_data` ENABLE KEYS */;

-- Дъмп структура за таблица stanimira_nikolova_db.users
DROP TABLE IF EXISTS `users`;
CREATE TABLE IF NOT EXISTS `users` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `username` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `username` (`username`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

-- Дъмп данни за таблица stanimira_nikolova_db.users: ~0 rows (approximately)
DELETE FROM `users`;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
INSERT INTO `users` (`id`, `username`, `password`) VALUES
	(1, 'philip', '');
/*!40000 ALTER TABLE `users` ENABLE KEYS */;

/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IF(@OLD_FOREIGN_KEY_CHECKS IS NULL, 1, @OLD_FOREIGN_KEY_CHECKS) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
